In [1]:
!pip install numpy
import numpy as np
import pandas as pd

Requirement already satisfied: numpy in c:\users\mrunal\anaconda3\lib\site-packages (1.26.4)

In [13]:
data = np.arange(12).reshape((4,3))
df = pd.DataFrame(data,index = ['Ohio','Colorado','Utah','New York'],columns = list('abc'))
df

          a   b   c
Ohio      0   1   2
Colorado  3   4   5
Utah      6   7   8
New York  9  10  11

In [18]:
stat_range = lambda x: x.max() - x.min()
df.apply(stat_range)

a    9
b    9
c    9
dtype: int64

In [17]:
square = lambda x:x**2
df.apply(square)

           a    b    c
Ohio       0    1    4
Colorado   9   16   25
Utah      36   49   64
New York  81  100  121

In [20]:
m = lambda x:x**2
print(df.map(m))
print(df.apply(m))

           a    b    c
Ohio       0    1    4
Colorado   9   16   25
Utah      36   49   64
New York  81  100  121
           a    b    c
Ohio       0    1    4
Colorado   9   16   25
Utah      36   49   64
New York  81  100  121

#### Pandas Sorting

In [21]:
series_1 = pd.Series([1,2,3,4,5],index = ['d','a','b','c','e'])
series_1

d    1
a    2
b    3
c    4
e    5
dtype: int64

In [30]:
sorted_index = series_1.sort_index(ascending=False)
sorted_series_1 = series_1.sort_values(ascending= False)
sorted_index
sorted_series_1 # by default sorting is done in ascending order , in case we want to sort otherwise, we need to set ascending to false

e    5
c    4
b    3
a    2
d    1
dtype: int64

In [34]:
df = pd.DataFrame({'a':[1,2,3,4],'b':[1,4,2,7]})
df.sort_values(by='b') # if we want sort list by 'b' key
df.sort_values(by = 'b',ascending = False) # sort in descending order

   a  b
3  4  7
1  2  4
2  3  2
0  1  1

In [36]:
df1 = pd.DataFrame({'A':['A0','A1','A2']}, index = ['K0','K1','K2'])
df2 = pd.DataFrame({'B':['B0','B1','B2']}, index = ['K0','K2','K3'])
joined_df = df1.join(df2,how='outer') # return both columns data
joined_df

      A    B
K0   A0   B0
K1   A1  NaN
K2   A2   B1
K3  NaN   B2

In [37]:
joined_df = df1.join(df2,how='inner') # return common data
joined_df

     A   B
K0  A0  B0
K2  A2  B1

In [38]:
joined_df = df1.join(df2,how='left') # return left sides whole data and right side common data
joined_df

     A    B
K0  A0   B0
K1  A1  NaN
K2  A2   B1

In [40]:
joined_df = df1.join(df2,how='right') # return right sides whole data and left side common data
joined_df

      A   B
K0   A0  B0
K2   A2  B1
K3  NaN  B2